Paciente8159/uCNC/uCNC/src/hal/mcus/stm32h7x/mcumap_stm32h7x.h
#define PWM10_MODE 0x0064
#else
#define PWM10_MODE 0x6400
#endif
#if (PWM10_CHANNEL > 2)
#define PWM10_CCMREG CCMR2
#else
#define PWM10_CCMREG CCMR1
#endif
#if (PWM10_TIMER == 1)
#define PWM10_ENOUTPUT                                                         \
  {                                                                            \
    TIM1->BDTR |= (1 << 15);                                                   \
  }
#elif (PWM10_TIMER == 8)
#define PWM10_ENOUTPUT                                                         \
  {                                                                            \
    TIM8->BDTR |= (1 << 15);                                                   \
  }
#else
#define PWM10_ENOUTPUT                                                         \
  {                                                                            \
  }
#endif
#if (PWM10_TIMER == 1) || (PWM10_TIMER == 2) || (PWM10_TIMER == 16)
#define PWM10_AF 0x01
#elif (PWM10_TIMER == 3) || (PWM10_TIMER == 4) || (PWM10_TIMER == 5) ||        \
    (PWM10_TIMER == 12)
#define PWM10_AF 0x02
#elif (PWM10_TIMER == 8)
#define PWM10_AF 0x03
#elif (PWM10_TIMER == 15)
#define PWM10_AF 0x04
#elif (PWM10_TIMER == 13) || (PWM10_TIMER == 14)
#define PWM10_AF 0x09
#else
#error 'Invalid PWM timer'
#endif
#define PWM10_CCR __ccr__(PWM10_CHANNEL)
#define DIO35_TIMER PWM10_TIMER
#define DIO35_CHANNEL PWM10_CHANNEL
#define DIO35_ENREG PWM10_ENREG
#define DIO35_APBEN PWM10_APBEN
#define DIO35_TIMREG PWM10_TIMREG
#define DIO35_APBEN PWM10_APBEN
#define DIO35_FREQ PWM10_FREQ
#define DIO35_MODE PWM10_MODE
#define DIO35_CCMREG PWM10_CCMREG
#define DIO35_CCR PWM10_CCR
#define DIO35_ENOUTPUT PWM10_ENOUTPUT
#define DIO35_AF PWM10_AF
#define DIO35_CLOCK PWM10_CLOCK
#endif
#if (defined(PWM11_CHANNEL) && defined(PWM11_TIMER) && defined(PWM11))
#if (PWM11_TIMER == 1 || (PWM11_TIMER >= 8 & PWM11_TIMER <= 11) ||             \
     (PWM11_TIMER >= 15 & PWM11_TIMER <= 17))
#define PWM11_ENREG RCC->APB2ENR
#define PWM11_APBEN __helper__(RCC_APB2ENR_TIM, PWM11_TIMER, EN)
#define PWM11_CLOCK HAL_RCC_GetPCLK2Freq()
#else
#define PWM11_ENREG RCC->APB1LENR
#define PWM11_APBEN __helper__(RCC_APB1LENR_TIM, PWM11_TIMER, EN)
#define PWM11_CLOCK HAL_RCC_GetPCLK1Freq()
#endif
#define PWM11_TIMREG (__tim__(PWM11_TIMER))
#ifndef PWM11_FREQ
#define PWM11_FREQ 1000
#endif
#if (PWM11_CHANNEL & 0x01)
#define PWM11_MODE 0x0064
#else
#define PWM11_MODE 0x6400
#endif
#if (PWM11_CHANNEL > 2)
#define PWM11_CCMREG CCMR2
#else
#define PWM11_CCMREG CCMR1
#endif
#if (PWM11_TIMER == 1)
#define PWM11_ENOUTPUT                                                         \
  {                                                                            \
    TIM1->BDTR |= (1 << 15);                                                   \
  }
#elif (PWM11_TIMER == 8)
#define PWM11_ENOUTPUT                                                         \
  {                                                                            \
    TIM8->BDTR |= (1 << 15);                                                   \
  }
#else
#define PWM11_ENOUTPUT                                                         \
  {                                                                            \
  }
#endif
#if (PWM11_TIMER == 1) || (PWM11_TIMER == 2) || (PWM11_TIMER == 16)
#define PWM11_AF 0x01
#elif (PWM11_TIMER == 3) || (PWM11_TIMER == 4) || (PWM11_TIMER == 5) ||        \
    (PWM11_TIMER == 12)
#define PWM11_AF 0x02
#elif (PWM11_TIMER == 8)
#define PWM11_AF 0x03
#elif (PWM11_TIMER == 15)
#define PWM11_AF 0x04
#elif (PWM11_TIMER == 13) || (PWM11_TIMER == 14)
#define PWM11_AF 0x09
#else
#error 'Invalid PWM timer'
#endif
#define PWM11_CCR __ccr__(PWM11_CHANNEL)
#define DIO36_TIMER PWM11_TIMER
#define DIO36_CHANNEL PWM11_CHANNEL
#define DIO36_ENREG PWM11_ENREG
#define DIO36_APBEN PWM11_APBEN
#define DIO36_TIMREG PWM11_TIMREG
#define DIO36_APBEN PWM11_APBEN
#define DIO36_FREQ PWM11_FREQ
#define DIO36_MODE PWM11_MODE
#define DIO36_CCMREG PWM11_CCMREG
#define DIO36_CCR PWM11_CCR
#define DIO36_ENOUTPUT PWM11_ENOUTPUT
#define DIO36_AF PWM11_AF
#define DIO36_CLOCK PWM11_CLOCK
#endif
#if (defined(PWM12_CHANNEL) && defined(PWM12_TIMER) && defined(PWM12))
#if (PWM12_TIMER == 1 || (PWM12_TIMER >= 8 & PWM12_TIMER <= 11) ||             \
     (PWM12_TIMER >= 15 & PWM12_TIMER <= 17))
#define PWM12_ENREG RCC->APB2ENR
#define PWM12_APBEN __helper__(RCC_APB2ENR_TIM, PWM12_TIMER, EN)
#define PWM12_CLOCK HAL_RCC_GetPCLK2Freq()
#else
#define PWM12_ENREG RCC->APB1LENR
#define PWM12_APBEN __helper__(RCC_APB1LENR_TIM, PWM12_TIMER, EN)
#define PWM12_CLOCK HAL_RCC_GetPCLK1Freq()
#endif
#define PWM12_TIMREG (__tim__(PWM12_TIMER))
#ifndef PWM12_FREQ
#define PWM12_FREQ 1000
#endif
#if (PWM12_CHANNEL & 0x01)
#define PWM12_MODE 0x0064
#else
#define PWM12_MODE 0x6400
#endif
#if (PWM12_CHANNEL > 2)
#define PWM12_CCMREG CCMR2
#else
#define PWM12_CCMREG CCMR1
#endif
#if (PWM12_TIMER == 1)
#define PWM12_ENOUTPUT                                                         \
  {                                                                            \
    TIM1->BDTR |= (1 << 15);                                                   \
  }
#elif (PWM12_TIMER == 8)
#define PWM12_ENOUTPUT                                                         \
  {                                                                            \
    TIM8->BDTR |= (1 << 15);                                                   \
  }
#else
#define PWM12_ENOUTPUT                                                         \
  {                                                                            \
  }
#endif
#if (PWM12_TIMER == 1) || (PWM12_TIMER == 2) || (PWM12_TIMER == 16)
#define PWM12_AF 0x01
#elif (PWM12_TIMER == 3) || (PWM12_TIMER == 4) || (PWM12_TIMER == 5) ||        \
    (PWM12_TIMER == 12)
#define PWM12_AF 0x02
#elif (PWM12_TIMER == 8)
#define PWM12_AF 0x03
#elif (PWM12_TIMER == 15)
#define PWM12_AF 0x04
#elif (PWM12_TIMER == 13) || (PWM12_TIMER == 14)
#define PWM12_AF 0x09
#else
#error 'Invalid PWM timer'
#endif
#define PWM12_CCR __ccr__(PWM12_CHANNEL)
#define DIO37_TIMER PWM12_TIMER
#define DIO37_CHANNEL PWM12_CHANNEL
#define DIO37_ENREG PWM12_ENREG
#define DIO37_APBEN PWM12_APBEN
#define DIO37_TIMREG PWM12_TIMREG
#define DIO37_APBEN PWM12_APBEN
#define DIO37_FREQ PWM12_FREQ
#define DIO37_MODE PWM12_MODE
#define DIO37_CCMREG PWM12_CCMREG
#define DIO37_CCR PWM12_CCR
#define DIO37_ENOUTPUT PWM12_ENOUTPUT
#define DIO37_AF PWM12_AF
#define DIO37_CLOCK PWM12_CLOCK
#endif
#if (defined(PWM13_CHANNEL) && defined(PWM13_TIMER) && defined(PWM13))
#if (PWM13_TIMER == 1 || (PWM13_TIMER >= 8 & PWM13_TIMER <= 11) ||             \
     (PWM13_TIMER >= 15 & PWM13_TIMER <= 17))
#define PWM13_ENREG RCC->APB2ENR
#define PWM13_APBEN __helper__(RCC_APB2ENR_TIM, PWM13_TIMER, EN)
#define PWM13_CLOCK HAL_RCC_GetPCLK2Freq()
#else
#define PWM13_ENREG RCC->APB1LENR
#define PWM13_APBEN __helper__(RCC_APB1LENR_TIM, PWM13_TIMER, EN)
#define PWM13_CLOCK HAL_RCC_GetPCLK1Freq()
#endif
#define PWM13_TIMREG (__tim__(PWM13_TIMER))
#ifndef PWM13_FREQ
#define PWM13_FREQ 1000
#endif
#if (PWM13_CHANNEL & 0x01)
#define PWM13_MODE 0x0064
#else
#define PWM13_MODE 0x6400
#endif
#if (PWM13_CHANNEL > 2)
#define PWM13_CCMREG CCMR2
#else
#define PWM13_CCMREG CCMR1
#endif
#if (PWM13_TIMER == 1)
#define PWM13_ENOUTPUT                                                         \
  {                                                                            \
    TIM1->BDTR |= (1 << 15);                                                   \
  }
#elif (PWM13_TIMER == 8)
#define PWM13_ENOUTPUT                                                         \
  {                                                                            \
    TIM8->BDTR |= (1 << 15);                                                   \
  }
#else
#define PWM13_ENOUTPUT                                                         \
  {                                                                            \
  }
#endif
#if (PWM13_TIMER == 1) || (PWM13_TIMER == 2) || (PWM13_TIMER == 16)
#define PWM13_AF 0x01
#elif (PWM13_TIMER == 3) || (PWM13_TIMER == 4) || (PWM13_TIMER == 5) ||        \
    (PWM13_TIMER == 12)
#define PWM13_AF 0x02
#elif (PWM13_TIMER == 8)
#define PWM13_AF 0x03
#elif (PWM13_TIMER == 15)
#define PWM13_AF 0x04
#elif (PWM13_TIMER == 13) || (PWM13_TIMER == 14)
#define PWM13_AF 0x09
#else
#error 'Invalid PWM timer'
#endif
#define PWM13_CCR __ccr__(PWM13_CHANNEL)
#define DIO38_TIMER PWM13_TIMER
#define DIO38_CHANNEL PWM13_CHANNEL
#define DIO38_ENREG PWM13_ENREG
#define DIO38_APBEN PWM13_APBEN
#define DIO38_TIMREG PWM13_TIMREG
#define DIO38_APBEN PWM13_APBEN
#define DIO38_FREQ PWM13_FREQ
#define DIO38_MODE PWM13_MODE
#define DIO38_CCMREG PWM13_CCMREG
#define DIO38_CCR PWM13_CCR
#define DIO38_ENOUTPUT PWM13_ENOUTPUT
#define DIO38_AF PWM13_AF
#define DIO38_CLOCK PWM13_CLOCK
#endif
#if (defined(PWM14_CHANNEL) && defined(PWM14_TIMER) && defined(PWM14))
#if (PWM14_TIMER == 1 || (PWM14_TIMER >= 8 & PWM14_TIMER <= 11) ||             \
     (PWM14_TIMER >= 15 & PWM14_TIMER <= 17))
#define PWM14_ENREG RCC->APB2ENR
#define PWM14_APBEN __helper__(RCC_APB2ENR_TIM, PWM14_TIMER, EN)
#define PWM14_CLOCK HAL_RCC_GetPCLK2Freq()
#else
#define PWM14_ENREG RCC->APB1LENR
#define PWM14_APBEN __helper__(RCC_APB1LENR_TIM, PWM14_TIMER, EN)
#define PWM14_CLOCK HAL_RCC_GetPCLK1Freq()
#endif
#define PWM14_TIMREG (__tim__(PWM14_TIMER))
#ifndef PWM14_FREQ
#define PWM14_FREQ 1000
#endif
#if (PWM14_CHANNEL & 0x01)
#define PWM14_MODE 0x0064
#else
#define PWM14_MODE 0x6400
#endif
#if (PWM14_CHANNEL > 2)
#define PWM14_CCMREG CCMR2
#else
#define PWM14_CCMREG CCMR1
#endif
#if (PWM14_TIMER == 1)
#define PWM14_ENOUTPUT                                                         \
  {                                                                            \
    TIM1->BDTR |= (1 << 15);                                                   \
  }
#elif (PWM14_TIMER == 8)
#define PWM14_ENOUTPUT                                                         \
  {                                                                            \
    TIM8->BDTR |= (1 << 15);                                                   \
  }
#else
#define PWM14_ENOUTPUT                                                         \
  {                                                                            \
  }
#endif
#if (PWM14_TIMER == 1) || (PWM14_TIMER == 2) || (PWM14_TIMER == 16)
#define PWM14_AF 0x01
#elif (PWM14_TIMER == 3) || (PWM14_TIMER == 4) || (PWM14_TIMER == 5) ||        \
    (PWM14_TIMER == 12)
#define PWM14_AF 0x02
#elif (PWM14_TIMER == 8)
#define PWM14_AF 0x03
#elif (PWM14_TIMER == 15)
#define PWM14_AF 0x04
#elif (PWM14_TIMER == 13) || (PWM14_TIMER == 14)
#define PWM14_AF 0x09
#else
#error 'Invalid PWM timer'
#endif
#define PWM14_CCR __ccr__(PWM14_CHANNEL)
#define DIO39_TIMER PWM14_TIMER
#define DIO39_CHANNEL PWM14_CHANNEL
#define DIO39_ENREG PWM14_ENREG
#define DIO39_APBEN PWM14_APBEN
#define DIO39_TIMREG PWM14_TIMREG
#define DIO39_APBEN PWM14_APBEN
#define DIO39_FREQ PWM14_FREQ
#define DIO39_MODE PWM14_MODE
#define DIO39_CCMREG PWM14_CCMREG
#define DIO39_CCR PWM14_CCR
#define DIO39_ENOUTPUT PWM14_ENOUTPUT
#define DIO39_AF PWM14_AF
#define DIO39_CLOCK PWM14_CLOCK
#endif
#if (defined(PWM15_CHANNEL) && defined(PWM15_TIMER) && defined(PWM15))
#if (PWM15_TIMER == 1 || (PWM15_TIMER >= 8 & PWM15_TIMER <= 11) ||             \
     (PWM15_TIMER >= 15 & PWM15_TIMER <= 17))
#define PWM15_ENREG RCC->APB2ENR
#define PWM15_APBEN __helper__(RCC_APB2ENR_TIM, PWM15_TIMER, EN)
#define PWM15_CLOCK HAL_RCC_GetPCLK2Freq()
#else
#define PWM15_ENREG RCC->APB1LENR
#define PWM15_APBEN __helper__(RCC_APB1LENR_TIM, PWM15_TIMER, EN)
#define PWM15_CLOCK HAL_RCC_GetPCLK1Freq()
#endif
#define PWM15_TIMREG (__tim__(PWM15_TIMER))
#ifndef PWM15_FREQ
#define PWM15_FREQ 1000
#endif
#if (PWM15_CHANNEL & 0x01)
#define PWM15_MODE 0x0064
#else
#define PWM15_MODE 0x6400
#endif
#if (PWM15_CHANNEL > 2)
#define PWM15_CCMREG CCMR2
#else
#define PWM15_CCMREG CCMR1
#endif
#if (PWM15_TIMER == 1)
#define PWM15_ENOUTPUT                                                         \
  {                                                                            \
    TIM1->BDTR |= (1 << 15);                                                   \
  }
#elif (PWM15_TIMER == 8)
#define PWM15_ENOUTPUT                                                         \
  {                                                                            \
    TIM8->BDTR |= (1 << 15);                                                   \
  }
#else
#define PWM15_ENOUTPUT                                                         \
  {                                                                            \
  }
#endif
#if (PWM15_TIMER == 1) || (PWM15_TIMER == 2) || (PWM15_TIMER == 16)
#define PWM15_AF 0x01
#elif (PWM15_TIMER == 3) || (PWM15_TIMER == 4) || (PWM15_TIMER == 5) ||        \
    (PWM15_TIMER == 12)
#define PWM15_AF 0x02
#elif (PWM15_TIMER == 8)
#define PWM15_AF 0x03
#elif (PWM15_TIMER == 15)
#define PWM15_AF 0x04
#elif (PWM15_TIMER == 13) || (PWM15_TIMER == 14)
#define PWM15_AF 0x09
#else
#error 'Invalid PWM timer'
#endif
#define PWM15_CCR __ccr__(PWM15_CHANNEL)
#define DIO40_TIMER PWM15_TIMER
#define DIO40_CHANNEL PWM15_CHANNEL
#define DIO40_ENREG PWM15_ENREG
#define DIO40_APBEN PWM15_APBEN
#define DIO40_TIMREG PWM15_TIMREG
#define DIO40_APBEN PWM15_APBEN
#define DIO40_FREQ PWM15_FREQ
#define DIO40_MODE PWM15_MODE
#define DIO40_CCMREG PWM15_CCMREG
#define DIO40_CCR PWM15_CCR
#define DIO40_ENOUTPUT PWM15_ENOUTPUT
#define DIO40_AF PWM15_AF
#define DIO40_CLOCK PWM15_CLOCK
#endif

/**********************************************
 *	Analog pins
 **********************************************/
#ifdef ANALOG0
#ifndef ANALOG0_CHANNEL
#define ANALOG0_CHANNEL -1
#endif
#ifndef ANALOG0_ADC
#define ANALOG0_ADC 1
#endif
#define DIO114_CHANNEL ANALOG0_CHANNEL
#define DIO114_ADC ANALOG0_ADC
#endif
#ifdef ANALOG1
#ifndef ANALOG1_CHANNEL
#define ANALOG1_CHANNEL -1
#endif
#ifndef ANALOG1_ADC
#define ANALOG1_ADC 1
#endif
#define DIO115_CHANNEL ANALOG1_CHANNEL
#define DIO115_ADC ANALOG1_ADC
#endif
#ifdef ANALOG2
#ifndef ANALOG2_CHANNEL
#define ANALOG2_CHANNEL -1
#endif
#ifndef ANALOG2_ADC
#define ANALOG2_ADC 1
#endif
#define DIO116_CHANNEL ANALOG2_CHANNEL
#define DIO116_ADC ANALOG2_ADC
#endif
#ifdef ANALOG3
#ifndef ANALOG3_CHANNEL
#define ANALOG3_CHANNEL -1
#endif
#ifndef ANALOG3_ADC
#define ANALOG3_ADC 1
#endif
#define DIO117_CHANNEL ANALOG3_CHANNEL
#define DIO117_ADC ANALOG3_ADC
#endif
#ifdef ANALOG4
#ifndef ANALOG4_CHANNEL
#define ANALOG4_CHANNEL -1
#endif
#ifndef ANALOG4_ADC
#define ANALOG4_ADC 1
#endif
#define DIO118_CHANNEL ANALOG4_CHANNEL
#define DIO118_ADC ANALOG4_ADC
#endif
#ifdef ANALOG5
#ifndef ANALOG5_CHANNEL
#define ANALOG5_CHANNEL -1
#endif
#ifndef ANALOG5_ADC
#define ANALOG5_ADC 1
#endif
#define DIO119_CHANNEL ANALOG5_CHANNEL
#define DIO119_ADC ANALOG5_ADC
#endif
#ifdef ANALOG6
#ifndef ANALOG6_CHANNEL
#define ANALOG6_CHANNEL -1
#endif
#ifndef ANALOG6_ADC
#define ANALOG6_ADC 1
#endif
#define DIO120_CHANNEL ANALOG6_CHANNEL
#define DIO120_ADC ANALOG6_ADC
#endif
#ifdef ANALOG7
#ifndef ANALOG7_CHANNEL
#define ANALOG7_CHANNEL -1
#endif
#ifndef ANALOG7_ADC
#define ANALOG7_ADC 1
#endif
#define DIO121_CHANNEL ANALOG7_CHANNEL
#define DIO121_ADC ANALOG7_ADC
#endif
#ifdef ANALOG8
#ifndef ANALOG8_CHANNEL
#define ANALOG8_CHANNEL -1
#endif
#ifndef ANALOG8_ADC
#define ANALOG8_ADC 1
#endif
#define DIO122_CHANNEL ANALOG8_CHANNEL
#define DIO122_ADC ANALOG8_ADC
#endif
#ifdef ANALOG9
#ifndef ANALOG9_CHANNEL
#define ANALOG9_CHANNEL -1
#endif
#ifndef ANALOG9_ADC
#define ANALOG9_ADC 1
#endif
#define DIO123_CHANNEL ANALOG9_CHANNEL
#define DIO123_ADC ANALOG9_ADC
#endif
#ifdef ANALOG10
#ifndef ANALOG10_CHANNEL
#define ANALOG10_CHANNEL -1
#endif
#ifndef ANALOG10_ADC
#define ANALOG10_ADC 1
#endif
#define DIO124_CHANNEL ANALOG10_CHANNEL
#define DIO124_ADC ANALOG10_ADC
#endif
#ifdef ANALOG11
#ifndef ANALOG11_CHANNEL
#define ANALOG11_CHANNEL -1
#endif
#ifndef ANALOG11_ADC
#define ANALOG11_ADC 1
#endif
#define DIO125_CHANNEL ANALOG11_CHANNEL
#define DIO125_ADC ANALOG11_ADC
#endif
#ifdef ANALOG12
#ifndef ANALOG12_CHANNEL
#define ANALOG12_CHANNEL -1
#endif
#ifndef ANALOG12_ADC
#define ANALOG12_ADC 1
#endif
#define DIO126_CHANNEL ANALOG12_CHANNEL
#define DIO126_ADC ANALOG12_ADC
#endif
#ifdef ANALOG13
#ifndef ANALOG13_CHANNEL
#define ANALOG13_CHANNEL -1
#endif
#ifndef ANALOG13_ADC
#define ANALOG13_ADC 1
#endif
#define DIO127_CHANNEL ANALOG13_CHANNEL
#define DIO127_ADC ANALOG13_ADC
#endif
#ifdef ANALOG14
#ifndef ANALOG14_CHANNEL
#define ANALOG14_CHANNEL -1
#endif
#ifndef ANALOG14_ADC
#define ANALOG14_ADC 1
#endif
#define DIO128_CHANNEL ANALOG14_CHANNEL
#define DIO128_ADC ANALOG14_ADC
#endif
#ifdef ANALOG15
#ifndef ANALOG15_CHANNEL
#define ANALOG15_CHANNEL -1
#endif
#ifndef ANALOG15_ADC
#define ANALOG15_ADC 1
#endif
#define DIO129_CHANNEL ANALOG15_CHANNEL
#define DIO129_ADC ANALOG15_ADC
#endif

// COM registers
#ifdef MCU_HAS_UART
// this MCU does not work well with both TX and RX interrupt
// this forces the sync TX method to fix communication

#ifndef UART_PORT
#define UART_PORT 1
#endif

#if (UART_PORT < 4 || UART_PORT == 6)
#define COM_UART __usart__(UART_PORT)
#define COM_IRQ __helper__(USART, UART_PORT, _IRQn)
#define MCU_SERIAL_ISR __helper__(USART, UART_PORT, _IRQHandler)
#else
#define COM_UART __uart__(UART_PORT)
#define COM_IRQ __helper__(UART, UART_PORT, _IRQn)
#define MCU_SERIAL_ISR __helper__(UART, UART_PORT, _IRQHandler)
#endif

#define COM_OUTREG (COM_UART)->TDR
#define COM_INREG (COM_UART)->RDR
#define COM_TX_PIN __iopin__(TX_PORT, TX_BIT)
#define COM_RX_PIN __iopin__(RX_PORT, RX_BIT)

#if (UART_PORT == 1) && (COM_TX_PIN == STM32IO_B8) && (COM_RX_PIN == STM32IO_B7)
#define COM_APB APB2ENR
#define COM_APBEN RCC_APB2ENR_USART1EN
#define GPIO_AF_USART 8
#elif (UART_PORT == 1) && (COM_TX_PIN == STM32IO_B14) &&                       \
    (COM_RX_PIN == STM32IO_B15)
#define COM_APB APB2ENR
#define COM_APBEN RCC_APB2ENR_USART1EN
#define GPIO_AF_USART 4
#elif (UART_PORT == 1) && (COM_TX_PIN == STM32IO_A9) &&                        \
    (COM_RX_PIN == STM32IO_A10)
#define COM_APB APB2ENR
#define COM_APBEN RCC_APB2ENR_USART1EN
#define GPIO_AF_USART 7
#elif (UART_PORT == 2) && (COM_TX_PIN == STM32IO_D5) &&                        \
    (COM_RX_PIN == STM32IO_D6)
#define COM_APB APB1LENR
#define COM_APBEN RCC_APB1LENR_USART2EN
#define GPIO_AF_USART 7
#elif (UART_PORT == 2) && (COM_TX_PIN == STM32IO_A2) &&                        \
    (COM_RX_PIN == STM32IO_A3)
#define COM_APB APB1LENR
#define COM_APBEN RCC_APB1LENR_USART2EN
#define GPIO_AF_USART 7
#elif (UART_PORT == 3) && (COM_TX_PIN == STM32IO_B10) &&                       \
    (COM_RX_PIN == STM32IO_B11)
#define COM_APB APB1LENR
#define COM_APBEN RCC_APB1LENR_USART3EN
#define GPIO_AF_USART 7
#elif (UART_PORT == 3) && (COM_TX_PIN == STM32IO_C10) &&                       \
    (COM_RX_PIN == STM32IO_C11)
#define COM_APB APB1LENR
#define COM_APBEN RCC_APB1LENR_USART3EN
#define GPIO_AF_USART 7
#elif (UART_PORT == 4) && (COM_TX_PIN == STM32IO_A0) &&                        \
    (COM_RX_PIN == STM32IO_A1)
#define COM_APB APB1LENR
#define COM_APBEN RCC_APB1LENR_USART4EN
#define GPIO_AF_USART 8
#elif (UART_PORT == 4) && (COM_TX_PIN == STM32IO_A12) &&                       \
    (COM_RX_PIN == STM32IO_A11)
#define COM_APB APB1LENR
#define COM_APBEN RCC_APB1LENR_USART4EN
#define GPIO_AF_USART 7
#elif (UART_PORT == 4) && (COM_TX_PIN == STM32IO_C10) &&                       \
    (COM_RX_PIN == STM32IO_C11)
#define COM_APB APB1LENR
#define COM_APBEN RCC_APB1LENR_USART4EN
#define GPIO_AF_USART 8
#elif (UART_PORT == 4) && (COM_TX_PIN == STM32IO_D1) &&                        \
    (COM_RX_PIN == STM32IO_D0)
#define COM_APB APB1LENR
#define COM_APBEN RCC_APB1LENR_USART4EN
#define GPIO_AF_USART 8
#elif (UART_PORT == 5) && (COM_TX_PIN == STM32IO_B6) &&                        \
    (COM_RX_PIN == STM32IO_B5)
#define COM_APB APB1LENR
#define COM_APBEN RCC_APB1LENR_USART5EN
#define GPIO_AF_USART 14
#elif (UART_PORT == 5) && (COM_TX_PIN == STM32IO_B13) &&                       \
    (COM_RX_PIN == STM32IO_B12)
#define COM_APB APB1LENR
#define COM_APBEN RCC_APB1LENR_USART5EN
#define GPIO_AF_USART 14
#elif (UART_PORT == 5) && (COM_TX_PIN == STM32IO_C12) &&                       \
    (COM_RX_PIN == STM32IO_D2)
#define COM_APB APB1LENR
#define COM_APBEN RCC_APB1LENR_USART5EN
#define GPIO_AF_USART 8
#elif (UART_PORT == 6) && (COM_TX_PIN == STM32IO_C6) &&                        \
    (COM_RX_PIN == STM32IO_C7)
#define COM_APB APB2ENR
#define COM_APBEN RCC_APB2ENR_USART6EN
#define GPIO_AF_USART 7
#elif (UART_PORT == 6) && (COM_TX_PIN == STM32IO_G14) &&                       \
    (COM_RX_PIN == STM32IO_G9)
#define COM_APB APB2ENR
#define COM_APBEN RCC_APB2ENR_USART6EN
#define GPIO_AF_USART 7
#elif (UART_PORT == 7) && (COM_TX_PIN == STM32IO_A15) &&                       \
    (COM_RX_PIN == STM32IO_A8)
#define COM_APB APB1LENR
#define COM_APBEN RCC_APB1LENR_USART7EN
#define GPIO_AF_USART 11
#elif (UART_PORT == 7) && (COM_TX_PIN == STM32IO_B4) &&                        \
    (COM_RX_PIN == STM32IO_B3)
#define COM_APB APB1LENR
#define COM_APBEN RCC_APB1LENR_USART7EN
#define GPIO_AF_USART 11
#elif (UART_PORT == 7) && (COM_TX_PIN == STM32IO_E8) &&                        \
    (COM_RX_PIN == STM32IO_E7)
#define COM_APB APB1LENR
#define COM_APBEN RCC_APB1LENR_USART7EN
#define GPIO_AF_USART 7
#elif (UART_PORT == 7) && (COM_TX_PIN == STM32IO_F7) &&                        \
    (COM_RX_PIN == STM32IO_F6)
#define COM_APB APB1LENR
#define COM_APBEN RCC_APB1LENR_USART7EN
#define GPIO_AF_USART 7
#elif (UART_PORT == 8) && (COM_TX_PIN == STM32IO_E1) &&                        \
    (COM_RX_PIN == STM32IO_E0)
#define COM_APB APB1LENR
#define COM_APBEN RCC_APB1LENR_USART8EN
#define GPIO_AF_USART 8
#else
#error "Invalid UART port configuration"
#endif

// remmaping and pin checking
//  USART	TX	RX	APB	APB2ENR	REMAP
//  1	A9	A10	APB2ENR	RCC_APB2ENR_USART1EN	0
//  1	B6	B7	APB2ENR	RCC_APB2ENR_USART1EN	1
//  2	A2	A3	APB1LENR	RCC_APB1LENR_USART2EN	0
//  2	D5	D6	APB1LENR	RCC_APB1LENR_USART2EN	1
//  3	B10	B11	APB1LENR	RCC_APB1LENR_USART3EN	0
//  3	C10	C11	APB1LENR	RCC_APB1LENR_USART3EN	1
//  3	D8	D9	APB1LENR	RCC_APB1LENR_USART3EN	3
//  4	C10	C11	APB1LENR	RCC_APB1LENR_UART4EN	x
//  5	C12	D2	APB1LENR	RCC_APB1LENR_UART5EN	x

#if ((UART_PORT == 1) || (UART_PORT == 6))
#define UART_CLOCK HAL_RCC_GetPCLK2Freq()
#else
#define UART_CLOCK HAL_RCC_GetPCLK1Freq()
#endif
#endif

#ifdef MCU_HAS_UART2
#ifndef BAUDRATE2
#define BAUDRATE2 BAUDRATE
#endif
#ifndef UART2_PORT
#define UART2_PORT 1
#endif
// this MCU does not work well with both TX and RX interrupt
// this forces the sync TX method to fix communication
#if (UART2_PORT < 4 || UART2_PORT == 6)
#define COM2_UART __usart__(UART2_PORT)
#define COM2_IRQ __helper__(USART, UART2_PORT, _IRQn)
#define MCU_SERIAL2_ISR __helper__(USART, UART2_PORT, _IRQHandler)
#else
#define COM2_UART __uart__(UART2_PORT)
#define COM2_IRQ __helper__(UART, UART2_PORT, _IRQn)
#define MCU_SERIAL2_ISR __helper__(UART, UART2_PORT, _IRQHandler)
#endif

#define COM2_OUTREG (COM2_UART)->TDR
#define COM2_INREG (COM2_UART)->RDR
#define COM2_TX_PIN __iopin__(TX2_PORT, TX2_BIT)
#define COM2_RX_PIN __iopin__(RX2_PORT, RX2_BIT)

