Paciente8159/uCNC/uCNC/src/hal/mcus/stm32h7x/mcumap_stm32h7x.h
// remmaping and pin checking
//  USART	TX	RX	APB	APB2ENR	REMAP
//  1	A9	A10	APB2ENR	RCC_APB2ENR_USART1EN	0
//  1	B6	B7	APB2ENR	RCC_APB2ENR_USART1EN	1
//  2	A2	A3	APB1ENR	RCC_APB1ENR_USART2EN	0
//  2	D5	D6	APB1ENR	RCC_APB1ENR_USART2EN	1
//  3	B10	B11	APB1ENR	RCC_APB1ENR_USART3EN	0
//  3	C10	C11	APB1ENR	RCC_APB1ENR_USART3EN	1
//  3	D8	D9	APB1ENR	RCC_APB1ENR_USART3EN	3
//  4	C10	C11	APB1ENR	RCC_APB1ENR_UART4EN	x
//  5	C12	D2	APB1ENR	RCC_APB1ENR_UART5EN	x
#if (UART2_PORT == 1) && (COM2_TX_PIN == STM32IO_B8) &&                        \
    (COM2_RX_PIN == STM32IO_B7)
#define COM2_APB APB2ENR
#define COM2_APBEN RCC_APB2ENR_USART1EN
#define GPIO_AF_USART2 8
#elif (UART2_PORT == 1) && (COM2_TX_PIN == STM32IO_B14) &&                     \
    (COM2_RX_PIN == STM32IO_B15)
#define COM2_APB APB2ENR
#define COM2_APBEN RCC_APB2ENR_USART1EN
#define GPIO_AF_USART2 4
#elif (UART2_PORT == 1) && (COM2_TX_PIN == STM32IO_A9) &&                      \
    (COM2_RX_PIN == STM32IO_A10)
#define COM2_APB APB2ENR
#define COM2_APBEN RCC_APB2ENR_USART1EN
#define GPIO_AF_USART2 7
#elif (UART2_PORT == 2) && (COM2_TX_PIN == STM32IO_D5) &&                      \
    (COM2_RX_PIN == STM32IO_D6)
#define COM2_APB APB1LENR
#define COM2_APBEN RCC_APB1LENR_USART2EN
#define GPIO_AF_USART2 7
#elif (UART2_PORT == 2) && (COM2_TX_PIN == STM32IO_A2) &&                      \
    (COM2_RX_PIN == STM32IO_A3)
#define COM2_APB APB1LENR
#define COM2_APBEN RCC_APB1LENR_USART2EN
#define GPIO_AF_USART2 7
#elif (UART2_PORT == 3) && (COM2_TX_PIN == STM32IO_B10) &&                     \
    (COM2_RX_PIN == STM32IO_B11)
#define COM2_APB APB1LENR
#define COM2_APBEN RCC_APB1LENR_USART3EN
#define GPIO_AF_USART2 7
#elif (UART2_PORT == 3) && (COM2_TX_PIN == STM32IO_C10) &&                     \
    (COM2_RX_PIN == STM32IO_C11)
#define COM2_APB APB1LENR
#define COM2_APBEN RCC_APB1LENR_USART3EN
#define GPIO_AF_USART2 7
#elif (UART2_PORT == 4) && (COM2_TX_PIN == STM32IO_A0) &&                      \
    (COM2_RX_PIN == STM32IO_A1)
#define COM2_APB APB1LENR
#define COM2_APBEN RCC_APB1LENR_USART4EN
#define GPIO_AF_USART2 8
#elif (UART2_PORT == 4) && (COM2_TX_PIN == STM32IO_A12) &&                     \
    (COM2_RX_PIN == STM32IO_A11)
#define COM2_APB APB1LENR
#define COM2_APBEN RCC_APB1LENR_USART4EN
#define GPIO_AF_USART2 7
#elif (UART2_PORT == 4) && (COM2_TX_PIN == STM32IO_C10) &&                     \
    (COM2_RX_PIN == STM32IO_C11)
#define COM2_APB APB1LENR
#define COM2_APBEN RCC_APB1LENR_USART4EN
#define GPIO_AF_USART2 8
#elif (UART2_PORT == 4) && (COM2_TX_PIN == STM32IO_D1) &&                      \
    (COM2_RX_PIN == STM32IO_D0)
#define COM2_APB APB1LENR
#define COM2_APBEN RCC_APB1LENR_USART4EN
#define GPIO_AF_USART2 8
#elif (UART2_PORT == 5) && (COM2_TX_PIN == STM32IO_B6) &&                      \
    (COM2_RX_PIN == STM32IO_B5)
#define COM2_APB APB1LENR
#define COM2_APBEN RCC_APB1LENR_USART5EN
#define GPIO_AF_USART2 14
#elif (UART2_PORT == 5) && (COM2_TX_PIN == STM32IO_B13) &&                     \
    (COM2_RX_PIN == STM32IO_B12)
#define COM2_APB APB1LENR
#define COM2_APBEN RCC_APB1LENR_USART5EN
#define GPIO_AF_USART2 14
#elif (UART2_PORT == 5) && (COM2_TX_PIN == STM32IO_C12) &&                     \
    (COM2_RX_PIN == STM32IO_D2)
#define COM2_APB APB1LENR
#define COM2_APBEN RCC_APB1LENR_USART5EN
#define GPIO_AF_USART2 8
#elif (UART2_PORT == 6) && (COM2_TX_PIN == STM32IO_C6) &&                      \
    (COM2_RX_PIN == STM32IO_C7)
#define COM2_APB APB2ENR
#define COM2_APBEN RCC_APB2ENR_USART6EN
#define GPIO_AF_USART2 7
#elif (UART2_PORT == 6) && (COM2_TX_PIN == STM32IO_G14) &&                     \
    (COM2_RX_PIN == STM32IO_G9)
#define COM2_APB APB2ENR
#define COM2_APBEN RCC_APB2ENR_USART6EN
#define GPIO_AF_USART2 7
#elif (UART2_PORT == 7) && (COM2_TX_PIN == STM32IO_A15) &&                     \
    (COM2_RX_PIN == STM32IO_A8)
#define COM2_APB APB1LENR
#define COM2_APBEN RCC_APB1LENR_USART7EN
#define GPIO_AF_USART2 11
#elif (UART2_PORT == 7) && (COM2_TX_PIN == STM32IO_B4) &&                      \
    (COM2_RX_PIN == STM32IO_B3)
#define COM2_APB APB1LENR
#define COM2_APBEN RCC_APB1LENR_USART7EN
#define GPIO_AF_USART2 11
#elif (UART2_PORT == 7) && (COM2_TX_PIN == STM32IO_E8) &&                      \
    (COM2_RX_PIN == STM32IO_E7)
#define COM2_APB APB1LENR
#define COM2_APBEN RCC_APB1LENR_USART7EN
#define GPIO_AF_USART2 7
#elif (UART2_PORT == 7) && (COM2_TX_PIN == STM32IO_F7) &&                      \
    (COM2_RX_PIN == STM32IO_F6)
#define COM2_APB APB1LENR
#define COM2_APBEN RCC_APB1LENR_USART7EN
#define GPIO_AF_USART2 7
#elif (UART2_PORT == 8) && (COM2_TX_PIN == STM32IO_E1) &&                      \
    (COM2_RX_PIN == STM32IO_E0)
#define COM2_APB APB1LENR
#define COM2_APBEN RCC_APB1LENR_USART8EN
#define GPIO_AF_USART2 8
#else
#error "Invalid UART2 port configuration"
#endif

#if ((UART2_PORT == 1) || (UART2_PORT == 6))
#define UART2_CLOCK HAL_RCC_GetPCLK2Freq()
#else
#define UART2_CLOCK HAL_RCC_GetPCLK1Freq()
#endif
#endif

#if (defined(SPI_CLK) && defined(SPI_SDO) && defined(SPI_SDI))
#define SPI_CLK_PIN __iopin__(SPI_CLK_PORT, SPI_CLK_BIT)
#define SPI_SDO_PIN __iopin__(SPI_SDO_PORT, SPI_SDO_BIT)
#define SPI_SDI_PIN __iopin__(SPI_SDI_PORT, SPI_SDI_BIT)
#ifdef SPI_CS
#define SPI_CS_PIN __iopin__(SPI_CS_PORT, SPI_CS_BIT)
#endif
#define MCU_HAS_SPI
#ifndef SPI_PORT
#define SPI_PORT 1
#endif
#ifndef SPI_MODE
#define SPI_MODE 0
#endif
#ifndef SPI_FREQ
#define SPI_FREQ 1000000UL
#endif
// remmaping and pin checking
#if (SPI_PORT == 1) && (SPI_CS_PIN == STM32IO_A4)
#define SPI_CS_AFIO 5
#endif
#if (SPI_PORT == 1) && (SPI_CLK_PIN == STM32IO_A5)
#define SPI_CLK_AFIO 5
#endif
#if (SPI_PORT == 1) && (SPI_SDI_PIN == STM32IO_A6)
#define SPI_SDI_AFIO 5
#endif
#if (SPI_PORT == 1) && (SPI_SDO_PIN == STM32IO_A7)
#define SPI_SDO_AFIO 5
#endif
#if (SPI_PORT == 3) && (SPI_CS_PIN == STM32IO_A4)
#define SPI_CS_AFIO 6
#endif
#if (SPI_PORT == 6) && (SPI_CLK_PIN == STM32IO_A5)
#define SPI_CLK_AFIO 8
#endif
#if (SPI_PORT == 2) && (SPI_CLK_PIN == STM32IO_A9)
#define SPI_CLK_AFIO 5
#endif
#if (SPI_PORT == 2) && (SPI_CS_PIN == STM32IO_A11)
#define SPI_CS_AFIO 5
#endif
#if (SPI_PORT == 2) && (SPI_CLK_PIN == STM32IO_A12)
#define SPI_CLK_AFIO 5
#endif
#if (SPI_PORT == 1) && (SPI_CS_PIN == STM32IO_A15)
#define SPI_CS_AFIO 5
#endif
#if (SPI_PORT == 3) && (SPI_CS_PIN == STM32IO_A15)
#define SPI_CS_AFIO 6
#endif
#if (SPI_PORT == 6) && (SPI_CS_PIN == STM32IO_A15)
#define SPI_CS_AFIO 7
#endif
#if (SPI_PORT == 1) && (SPI_CLK_PIN == STM32IO_B3)
#define SPI_CLK_AFIO 5
#endif
#if (SPI_PORT == 1) && (SPI_SDI_PIN == STM32IO_B4)
#define SPI_SDI_AFIO 5
#endif
#if (SPI_PORT == 1) && (SPI_SDO_PIN == STM32IO_B5)
#define SPI_SDO_AFIO 5
#endif
#if (SPI_PORT == 3) && (SPI_CLK_PIN == STM32IO_B3)
#define SPI_CLK_AFIO 6
#endif
#if (SPI_PORT == 3) && (SPI_SDI_PIN == STM32IO_B4)
#define SPI_SDI_AFIO 6
#endif
#if (SPI_PORT == 3) && (SPI_SDO_PIN == STM32IO_B2)
#define SPI_SDO_AFIO 7
#endif
#if (SPI_PORT == 2) && (SPI_CS_PIN == STM32IO_B4)
#define SPI_CS_AFIO 7
#endif
#if (SPI_PORT == 3) && (SPI_SDO_PIN == STM32IO_B5)
#define SPI_SDO_AFIO 7
#endif
#if (SPI_PORT == 6) && (SPI_CLK_PIN == STM32IO_B3)
#define SPI_CLK_AFIO 8
#endif
#if (SPI_PORT == 6) && (SPI_SDI_PIN == STM32IO_B4)
#define SPI_SDI_AFIO 8
#endif
#if (SPI_PORT == 6) && (SPI_SDO_PIN == STM32IO_B5)
#define SPI_SDO_AFIO 8
#endif
#if (SPI_PORT == 2) && (SPI_CS_PIN == STM32IO_B9)
#define SPI_CS_AFIO 5
#endif
#if (SPI_PORT == 2) && (SPI_CLK_PIN == STM32IO_B10)
#define SPI_CLK_AFIO 5
#endif
#if (SPI_PORT == 2) && (SPI_CS_PIN == STM32IO_B12)
#define SPI_CS_AFIO 5
#endif
#if (SPI_PORT == 2) && (SPI_CLK_PIN == STM32IO_B13)
#define SPI_CLK_AFIO 5
#endif
#if (SPI_PORT == 2) && (SPI_SDI_PIN == STM32IO_B14)
#define SPI_SDI_AFIO 5
#endif
#if (SPI_PORT == 2) && (SPI_SDO_PIN == STM32IO_B15)
#define SPI_SDO_AFIO 5
#endif
#if (SPI_PORT == 2) && (SPI_SDO_PIN == STM32IO_C1)
#define SPI_SDO_AFIO 5
#endif
#if (SPI_PORT == 2) && (SPI_SDI_PIN == STM32IO_C2)
#define SPI_SDI_AFIO 5
#endif
#if (SPI_PORT == 2) && (SPI_SDO_PIN == STM32IO_C3)
#define SPI_SDO_AFIO 5
#endif
#if (SPI_PORT == 3) && (SPI_CLK_PIN == STM32IO_C10)
#define SPI_CLK_AFIO 6
#endif
#if (SPI_PORT == 3) && (SPI_SDI_PIN == STM32IO_C11)
#define SPI_SDI_AFIO 6
#endif
#if (SPI_PORT == 3) && (SPI_SDO_PIN == STM32IO_C12)
#define SPI_SDO_AFIO 6
#endif
#if (SPI_PORT == 2) && (SPI_CLK_PIN == STM32IO_D3)
#define SPI_CLK_AFIO 5
#endif
#if (SPI_PORT == 3) && (SPI_SDO_PIN == STM32IO_D6)
#define SPI_SDO_AFIO 5
#endif
#if (SPI_PORT == 1) && (SPI_SDO_PIN == STM32IO_D7)
#define SPI_SDO_AFIO 5
#endif
#if (SPI_PORT == 4) && (SPI_CLK_PIN == STM32IO_E2)
#define SPI_CLK_AFIO 5
#endif
#if (SPI_PORT == 4) && (SPI_CS_PIN == STM32IO_E4)
#define SPI_CS_AFIO 5
#endif
#if (SPI_PORT == 4) && (SPI_SDI_PIN == STM32IO_E5)
#define SPI_SDI_AFIO 5
#endif
#if (SPI_PORT == 4) && (SPI_SDO_PIN == STM32IO_E6)
#define SPI_SDO_AFIO 5
#endif
#if (SPI_PORT == 4) && (SPI_CS_PIN == STM32IO_E11)
#define SPI_CS_AFIO 5
#endif
#if (SPI_PORT == 4) && (SPI_CLK_PIN == STM32IO_E12)
#define SPI_CLK_AFIO 5
#endif
#if (SPI_PORT == 4) && (SPI_SDI_PIN == STM32IO_E13)
#define SPI_SDI_AFIO 5
#endif
#if (SPI_PORT == 4) && (SPI_SDO_PIN == STM32IO_E14)
#define SPI_SDO_AFIO 5
#endif
#if (SPI_PORT == 5) && (SPI_CS_PIN == STM32IO_F6)
#define SPI_CS_AFIO 5
#endif
#if (SPI_PORT == 5) && (SPI_CLK_PIN == STM32IO_F7)
#define SPI_CLK_AFIO 5
#endif
#if (SPI_PORT == 5) && (SPI_SDI_PIN == STM32IO_F8)
#define SPI_SDI_AFIO 5
#endif
#if (SPI_PORT == 5) && (SPI_SDO_PIN == STM32IO_F9)
#define SPI_SDO_AFIO 5
#endif
#if (SPI_PORT == 5) && (SPI_SDO_PIN == STM32IO_F11)
#define SPI_SDO_AFIO 5
#endif
#if (SPI_PORT == 6) && (SPI_CS_PIN == STM32IO_G8)
#define SPI_CS_AFIO 5
#endif
#if (SPI_PORT == 1) && (SPI_SDI_PIN == STM32IO_G9)
#define SPI_SDI_AFIO 5
#endif
#if (SPI_PORT == 1) && (SPI_CS_PIN == STM32IO_G10)
#define SPI_CS_AFIO 5
#endif
#if (SPI_PORT == 1) && (SPI_CLK_PIN == STM32IO_G11)
#define SPI_CLK_AFIO 5
#endif
#if (SPI_PORT == 6) && (SPI_SDI_PIN == STM32IO_G12)
#define SPI_SDI_AFIO 5
#endif
#if (SPI_PORT == 6) && (SPI_CLK_PIN == STM32IO_G13)
#define SPI_CLK_AFIO 5
#endif
#if (SPI_PORT == 6) && (SPI_SDO_PIN == STM32IO_G14)
#define SPI_SDO_AFIO 5
#endif
#if (SPI_PORT == 5) && (SPI_CS_PIN == STM32IO_H5)
#define SPI_CS_AFIO 5
#endif
#if (SPI_PORT == 5) && (SPI_CLK_PIN == STM32IO_H6)
#define SPI_CLK_AFIO 5
#endif
#if (SPI_PORT == 5) && (SPI_SDI_PIN == STM32IO_H7)
#define SPI_SDI_AFIO 5
#endif
#if (SPI_PORT == 2) && (SPI_CS_PIN == STM32IO_I0)
#define SPI_CS_AFIO 5
#endif
#if (SPI_PORT == 2) && (SPI_CLK_PIN == STM32IO_I1)
#define SPI_CLK_AFIO 5
#endif
#if (SPI_PORT == 2) && (SPI_SDI_PIN == STM32IO_I2)
#define SPI_SDI_AFIO 5
#endif
#if (SPI_PORT == 2) && (SPI_SDO_PIN == STM32IO_I3)
#define SPI_SDO_AFIO 5
#endif
#if (SPI_PORT == 5) && (SPI_SDO_PIN == STM32IO_J10)
#define SPI_SDO_AFIO 5
#endif
#if (SPI_PORT == 5) && (SPI_SDI_PIN == STM32IO_J11)
#define SPI_SDI_AFIO 5
#endif
#if (SPI_PORT == 5) && (SPI_CLK_PIN == STM32IO_K0)
#define SPI_CLK_AFIO 5
#endif
#if (SPI_PORT == 5) && (SPI_CS_PIN == STM32IO_K1)
#define SPI_CS_AFIO 5
#endif

#ifndef SPI_CLK_AFIO
#error "SPI pin configuration not supported"
#endif
#ifndef SPI_SDO_AFIO
#error "SPI pin configuration not supported"
#endif
#ifndef SPI_SDI_AFIO
#error "SPI pin configuration not supported"
#endif
// #ifdef SPI_CS
// #ifndef SPI_CS_AFIO
// #error "SPI pin configuration not supported"
// #endif
// #endif

#define SPI_REG __helper__(SPI, SPI_PORT, )
#if (SPI_PORT == 6)
#define SPI_ENREG RCC->APB4ENR
#define SPI_ENVAL __helper__(RCC_APB4ENR_SPI, SPI_PORT, EN)
// #define SPI_CLOCK HAL_RCC_GetPCLK1Freq()
#elif (SPI_PORT == 2 || SPI_PORT == 3)
#define SPI_ENREG RCC->APB1LENR
#define SPI_ENVAL __helper__(RCC_APB1LENR_SPI, SPI_PORT, EN)
// #define SPI_CLOCK HAL_RCC_GetPCLK1Freq()
#else
#define SPI_ENREG RCC->APB2ENR
#define SPI_ENVAL __helper__(RCC_APB2ENR_SPI, SPI_PORT, EN)
// #define SPI_CLOCK HAL_RCC_GetPCLK2Freq()
#endif

#define SPI_CLOCK HSI_VALUE
#define SPI_CLOCK_SLOW CSI_VALUE
#define SPI_CLOCK_SOURCE_CFG __helper__(__HAL_RCC_SPI, SPI_PORT, _CONFIG)
#define SPI_CLOCK_SOURCE __helper__(RCC_SPI, SPI_PORT, CLKSOURCE_CLKP)

#define SPI_IRQ __helper__(SPI, SPI_PORT, _IRQn)
#define SPI_ISR __helper__(SPI, SPI_PORT, _IRQHandler)

#if (SPI_PORT == 1)
#define SPI_DMA_CONTROLLER_NUM 2
#define SPI_DMA_TX_STREAM_NUM 3
#define SPI_DMA_RX_STREAM_NUM 2
#define SPI_DMA_TX_CHANNEL 3
#define SPI_DMA_RX_CHANNEL 3
#define SPI_DMA_TX_IFR_POS 22
#define SPI_DMA_RX_IFR_POS 16
#elif (SPI_PORT == 2)
#define SPI_DMA_CONTROLLER_NUM 1
#define SPI_DMA_TX_STREAM_NUM 4
#define SPI_DMA_RX_STREAM_NUM 3
#define SPI_DMA_TX_CHANNEL 0
#define SPI_DMA_RX_CHANNEL 0
#define SPI_DMA_TX_IFR_POS 0
#define SPI_DMA_RX_IFR_POS 22
#elif (SPI_PORT == 3)
#define SPI_DMA_CONTROLLER_NUM 1
#define SPI_DMA_TX_CHANNEL 0
#define SPI_DMA_RX_CHANNEL 0
#define SPI_DMA_TX_STREAM_NUM 5
#define SPI_DMA_RX_STREAM_NUM 2
#define SPI_DMA_TX_IFR_POS 6
#define SPI_DMA_RX_IFR_POS 16
#elif (SPI_PORT == 4)
#define SPI_DMA_CONTROLLER_NUM 2
#define SPI_DMA_TX_CHANNEL 5
#define SPI_DMA_RX_CHANNEL 5
#define SPI_DMA_TX_STREAM_NUM 4
#define SPI_DMA_RX_STREAM_NUM 3
#define SPI_DMA_TX_IFR_POS 0
#define SPI_DMA_RX_IFR_POS 22
#elif (SPI_PORT == 5)
#define SPI_DMA_CONTROLLER_NUM 2
#define SPI_DMA_TX_CHANNEL 7
#define SPI_DMA_RX_CHANNEL 7
#define SPI_DMA_TX_STREAM_NUM 6
#define SPI_DMA_RX_STREAM_NUM 5
#define SPI_DMA_TX_IFR_POS 16
#define SPI_DMA_RX_IFR_POS 6
#else
#error "Invalid SPI port"
#endif

