Paciente8159/uCNC/uCNC/src/hal/mcus/stm32h7x/mcumap_stm32h7x.h
#ifndef SPI2_CLK_AFIO
#error "SPI2 pin configuration not supported"
#endif
#ifndef SPI2_SDO_AFIO
#error "SPI2 pin configuration not supported"
#endif
#ifndef SPI2_SDI_AFIO
#error "SPI2 pin configuration not supported"
#endif
// #ifdef SPI2_CS
// #ifndef SPI2_CS_AFIO
// #error "SPI2 pin configuration not supported"
// #endif
// #endif

#define SPI2_REG __helper__(SPI2, SPI2_PORT, )
#if (SPI2_PORT == 6)
#define SPI2_ENREG RCC->APB4ENR
#define SPI2_ENVAL __helper__(RCC_APB4ENR_SPI2, SPI2_PORT, EN)
// #define SPI2_CLOCK HAL_RCC_GetPCLK1Freq()
#elif (SPI2_PORT == 2 || SPI2_PORT == 3)
#define SPI2_ENREG RCC->APB1LENR
#define SPI2_ENVAL __helper__(RCC_APB1LENR_SPI2, SPI2_PORT, EN)
// #define SPI2_CLOCK HAL_RCC_GetPCLK1Freq()
#else
#define SPI2_ENREG RCC->APB2ENR
#define SPI2_ENVAL __helper__(RCC_APB2ENR_SPI2, SPI2_PORT, EN)
// #define SPI2_CLOCK HAL_RCC_GetPCLK2Freq()
#endif

#define SPI2_CLOCK HSI_VALUE
#define SPI2_CLOCK_SLOW CSI_VALUE
#define SPI2_CLOCK_SOURCE_CFG __helper__(__HAL_RCC_SPI2, SPI2_PORT, _CONFIG)
#define SPI2_CLOCK_SOURCE __helper__(RCC_SPI2, SPI2_PORT, CLKSOURCE_CLKP)

#define SPI2_IRQ __helper__(SPI2, SPI2_PORT, _IRQn)
#define SPI2_ISR __helper__(SPI2, SPI2_PORT, _IRQHandler)

#if (SPI2_PORT == 1)
#define SPI2_DMA_CONTROLLER_NUM 2
#define SPI2_DMA_TX_STREAM_NUM 3
#define SPI2_DMA_RX_STREAM_NUM 2
#define SPI2_DMA_TX_CHANNEL 3
#define SPI2_DMA_RX_CHANNEL 3
#define SPI2_DMA_TX_IFR_POS 22
#define SPI2_DMA_RX_IFR_POS 16
#elif (SPI2_PORT == 2)
#define SPI2_DMA_CONTROLLER_NUM 1
#define SPI2_DMA_TX_STREAM_NUM 4
#define SPI2_DMA_RX_STREAM_NUM 3
#define SPI2_DMA_TX_CHANNEL 0
#define SPI2_DMA_RX_CHANNEL 0
#define SPI2_DMA_TX_IFR_POS 0
#define SPI2_DMA_RX_IFR_POS 22
#elif (SPI2_PORT == 3)
#define SPI2_DMA_CONTROLLER_NUM 1
#define SPI2_DMA_TX_CHANNEL 0
#define SPI2_DMA_RX_CHANNEL 0
#define SPI2_DMA_TX_STREAM_NUM 5
#define SPI2_DMA_RX_STREAM_NUM 2
#define SPI2_DMA_TX_IFR_POS 6
#define SPI2_DMA_RX_IFR_POS 16
#elif (SPI2_PORT == 4)
#define SPI2_DMA_CONTROLLER_NUM 2
#define SPI2_DMA_TX_CHANNEL 5
#define SPI2_DMA_RX_CHANNEL 5
#define SPI2_DMA_TX_STREAM_NUM 4
#define SPI2_DMA_RX_STREAM_NUM 3
#define SPI2_DMA_TX_IFR_POS 0
#define SPI2_DMA_RX_IFR_POS 22
#elif (SPI2_PORT == 5)
#define SPI2_DMA_CONTROLLER_NUM 2
#define SPI2_DMA_TX_CHANNEL 7
#define SPI2_DMA_RX_CHANNEL 7
#define SPI2_DMA_TX_STREAM_NUM 6
#define SPI2_DMA_RX_STREAM_NUM 5
#define SPI2_DMA_TX_IFR_POS 16
#define SPI2_DMA_RX_IFR_POS 6
#else
#error "Invalid SPI2 port"
#endif

#define SPI2_DMA_CONTROLLER __helper__(DMA, SPI2_DMA_CONTROLLER_NUM, )
#define SPI2_DMA_EN __helper__(RCC_AHBENR_DMA, SPI2_DMA_CONTROLLER_NUM, EN)

#define SPI2_DMA_TX_STREAM                                                     \
  __helper__(__helper__(DMA, SPI2_DMA_CONTROLLER_NUM, _Stream),                \
             SPI2_DMA_TX_STREAM_NUM, )
#if (SPI2_DMA_TX_STREAM_NUM <= 3)
#define SPI2_DMA_TX_IFCR SPI2_DMA_CONTROLLER->LIFCR
#define SPI2_DMA_TX_ISR SPI2_DMA_CONTROLLER->LISR
#else
#define SPI2_DMA_TX_IFCR SPI2_DMA_CONTROLLER->HIFCR
#define SPI2_DMA_TX_ISR SPI2_DMA_CONTROLLER->HISR
#endif

#define SPI2_DMA_RX_STREAM                                                     \
  __helper__(__helper__(DMA, SPI2_DMA_CONTROLLER_NUM, _Stream),                \
             SPI2_DMA_RX_STREAM_NUM, )
#if (SPI2_DMA_RX_STREAM_NUM <= 3)
#define SPI2_DMA_RX_IFCR SPI2_DMA_CONTROLLER->LIFCR
#define SPI2_DMA_RX_ISR SPI2_DMA_CONTROLLER->LISR
#else
#define SPI2_DMA_RX_IFCR SPI2_DMA_CONTROLLER->HIFCR
#define SPI2_DMA_RX_ISR SPI2_DMA_CONTROLLER->HISR
#endif

#define SPI2_DMA_TX_IFCR_MASK (0b111101 << SPI2_DMA_TX_IFR_POS)
#define SPI2_DMA_RX_IFCR_MASK (0b111101 << SPI2_DMA_RX_IFR_POS)

#endif

// I2C
#if (defined(I2C_CLK) && defined(I2C_DATA))

#define I2C_CLK_PIN __iopin__(I2C_CLK_PORT, I2C_CLK_BIT)
#define I2C_DATA_PIN __iopin__(I2C_DATA_PORT, I2C_DATA_BIT)

#define MCU_HAS_I2C
#define MCU_SUPPORTS_I2C_SLAVE
#ifndef I2C_ADDRESS
#define I2C_ADDRESS 0
#endif

#ifndef I2C_PORT
#define I2C_PORT 1
#endif

#if (I2C_PORT == 4)
#define I2C_APBREG APB4ENR
#define I2C_APBEN __helper__(RCC_APB4ENR_I2C, I2C_PORT, EN)
#else
#define I2C_APBREG APB1LENR
#define I2C_APBEN __helper__(RCC_APB1LENR_I2C, I2C_PORT, EN)
#endif
#define I2C_REG __helper__(I2C, I2C_PORT, )

#define I2C_CLOCK_SOURCE_CFG __helper__(__HAL_RCC_I2C, I2C_PORT, _CONFIG)
#define I2C_CLOCK_SOURCE __helper__(RCC_I2C, I2C_PORT, CLKSOURCE_CSI)

#if (I2C_PORT == 1)
#if (I2C_DATA_PIN == STM32IO_A10)
#define I2C_DATA_AFIO 4
#endif
#if (I2C_CLK_PIN == STM32IO_B6)
#define I2C_CLK_AFIO 4
#endif
#if (I2C_DATA_PIN == STM32IO_B7)
#define I2C_DATA_AFIO 4
#endif
#if (I2C_CLK_PIN == STM32IO_B8)
#define I2C_CLK_AFIO 4
#endif
#if (I2C_DATA_PIN == STM32IO_B9)
#define I2C_DATA_AFIO 4
#endif
#if (I2C_CLK_PIN == STM32IO_F1)
#define I2C_CLK_AFIO 4
#endif
#if (I2C_DATA_PIN == STM32IO_F0)
#define I2C_DATA_AFIO 4
#endif
#elif (I2C_PORT == 2)
#if (I2C_CLK_PIN == STM32IO_B10)
#define I2C_CLK_AFIO 4
#endif
#if (I2C_DATA_PIN == STM32IO_B11)
#define I2C_DATA_AFIO 4
#endif
#if (I2C_CLK_PIN == STM32IO_F14)
#define I2C_CLK_AFIO 4
#endif
#if (I2C_DATA_PIN == STM32IO_F15)
#define I2C_DATA_AFIO 4
#endif
#if (I2C_CLK_PIN == STM32IO_H4)
#define I2C_CLK_AFIO 4
#endif
#if (I2C_DATA_PIN == STM32IO_H5)
#define I2C_DATA_AFIO 4
#endif
#elif (I2C_PORT == 3)
#if (I2C_CLK_PIN == STM32IO_A8)
#define I2C_CLK_AFIO 4
#endif
#if (I2C_CLK_PIN == STM32IO_C9)
#define I2C_DATA_AFIO 4
#endif
#if (I2C_CLK_PIN == STM32IO_H7)
#define I2C_CLK_AFIO 4
#endif
#if (I2C_DATA_PIN == STM32IO_H8)
#define I2C_DATA_AFIO 4
#endif
#elif (I2C_PORT == 4)
#if (I2C_CLK_PIN == STM32IO_D12)
#define I2C_CLK_AFIO 4
#endif
#if (I2C_DATA_PIN == STM32IO_D13)
#define I2C_DATA_AFIO 4
#endif
#if (I2C_CLK_PIN == STM32IO_F14)
#define I2C_CLK_AFIO 4
#endif
#if (I2C_DATA_PIN == STM32IO_F15)
#define I2C_DATA_AFIO 4
#endif
#if (I2C_CLK_PIN == STM32IO_H11)
#define I2C_CLK_AFIO 4
#endif
#if (I2C_DATA_PIN == STM32IO_H12)
#define I2C_DATA_AFIO 4
#endif
#if (I2C_CLK_PIN == STM32IO_B6)
#define I2C_CLK_AFIO 6
#endif
#if (I2C_DATA_PIN == STM32IO_B7)
#define I2C_DATA_AFIO 6
#endif
#if (I2C_CLK_PIN == STM32IO_B8)
#define I2C_CLK_AFIO 6
#endif
#if (I2C_DATA_PIN == STM32IO_B9)
#define I2C_DATA_AFIO 6
#endif
#endif

#define I2C_IRQ __helper__(I2C, I2C_PORT, _IRQn)
#define I2C_ISR __helper__(I2C, I2C_PORT, _IRQHandler)

#ifndef I2C_FREQ
#define I2C_FREQ 400000UL
#endif
#endif

// Timer registers
#ifndef ITP_TIMER
#define ITP_TIMER 2
#endif

#if (ITP_TIMER == 6)
#define MCU_ITP_ISR TIM6_DAC_IRQHandler
#define MCU_ITP_IRQ TIM6_DAC_IRQn
#elif (ITP_TIMER == 9)
#define MCU_ITP_ISR TIM1_BRK_TIM9_IRQHandler
#define MCU_ITP_IRQ TIM1_BRK_TIM9_IRQn
#elif (ITP_TIMER == 10 || ITP_TIMER == 1)
#define MCU_ITP_ISR TIM1_UP_TIM10_IRQHandler
#define MCU_ITP_IRQ TIM1_UP_TIM10_IRQn
#elif (ITP_TIMER == 11)
#define MCU_ITP_ISR TIM1_TRG_COM_TIM11_IRQHandler
#define MCU_ITP_IRQ TIM1_TRG_COM_TIM11_IRQn
#elif (ITP_TIMER == 12)
#define MCU_ITP_ISR TIM8_BRK_TIM12_IRQHandler
#define MCU_ITP_IRQ TIM8_BRK_TIM12_IRQn
#elif (ITP_TIMER == 13 || ITP_TIMER == 8)
#define MCU_ITP_ISR TIM8_UP_TIM13_IRQHandler
#define MCU_ITP_IRQ TIM8_UP_TIM13_IRQn
#elif (ITP_TIMER == 14)
#define MCU_ITP_ISR TIM8_TRG_COM_TIM14_IRQHandler
#define MCU_ITP_IRQ TIM8_TRG_COM_TIM14_IRQn
#else
#define MCU_ITP_ISR __helper__(TIM, ITP_TIMER, _IRQHandler)
#define MCU_ITP_IRQ __helper__(TIM, ITP_TIMER, _IRQn)
#endif

#define TIMER_REG __helper__(TIM, ITP_TIMER, )

