Paciente8159/uCNC/uCNC/src/hal/mcus/stm32h7x/mcumap_stm32h7x.h
#if (ITP_TIMER == 1 || (ITP_TIMER >= 8 & ITP_TIMER <= 11) ||                   \
     (ITP_TIMER >= 15 & ITP_TIMER <= 17))
#define TIMER_ENREG APB2ENR
#define TIMER_RESETREG APB2RSTR
#define TIMER_APB __helper__(RCC_APB2ENR_TIM, ITP_TIMER, EN)
#define TIMER_CLOCK HAL_RCC_GetPCLK2Freq()
#else
#define TIMER_ENREG APB1LENR
#define TIMER_RESETREG APB1LRSTR
#define TIMER_APB __helper__(RCC_APB1LENR_TIM, ITP_TIMER, EN)
#define TIMER_CLOCK HAL_RCC_GetPCLK1Freq()
#endif

#ifndef SERVO_TIMER
#define SERVO_TIMER 3
#endif

#if (SERVO_TIMER == 6)
#define MCU_SERVO_ISR TIM6_DAC_IRQHandler
#define MCU_SERVO_IRQ TIM6_DAC_IRQn
#elif (SERVO_TIMER == 9)
#define MCU_SERVO_ISR TIM1_BRK_TIM9_IRQHandler
#define MCU_SERVO_IRQ TIM1_BRK_TIM9_IRQn
#elif (SERVO_TIMER == 10 || SERVO_TIMER == 1)
#define MCU_SERVO_ISR TIM1_UP_TIM10_IRQHandler
#define MCU_SERVO_IRQ TIM1_UP_TIM10_IRQn
#elif (SERVO_TIMER == 11)
#define MCU_SERVO_ISR TIM1_TRG_COM_TIM11_IRQHandler
#define MCU_SERVO_IRQ TIM1_TRG_COM_TIM11_IRQn
#elif (SERVO_TIMER == 12)
#define MCU_SERVO_ISR TIM8_BRK_TIM12_IRQHandler
#define MCU_SERVO_IRQ TIM8_BRK_TIM12_IRQn
#elif (SERVO_TIMER == 13 || SERVO_TIMER == 8)
#define MCU_SERVO_ISR TIM8_UP_TIM13_IRQHandler
#define MCU_SERVO_IRQ TIM8_UP_TIM13_IRQn
#elif (SERVO_TIMER == 14)
#define MCU_SERVO_ISR TIM8_TRG_COM_TIM14_IRQHandler
#define MCU_SERVO_IRQ TIM8_TRG_COM_TIM14_IRQn
#else
#define MCU_SERVO_ISR __helper__(TIM, SERVO_TIMER, _IRQHandler)
#define MCU_SERVO_IRQ __helper__(TIM, SERVO_TIMER, _IRQn)
#endif

#define SERVO_TIMER_REG __helper__(TIM, SERVO_TIMER, )

#if (SERVO_TIMER == 1 || (SERVO_TIMER >= 8 & SERVO_TIMER <= 11) ||             \
     (SERVO_TIMER >= 15 & SERVO_TIMER <= 17))
#define SERVO_TIMER_ENREG APB2ENR
#define SERVO_TIMER_RESETREG APB2RSTR
#define SERVO_TIMER_APB __helper__(RCC_APB2ENR_TIM, SERVO_TIMER, EN)
#define SERVO_TIMER_CLOCK HAL_RCC_GetPCLK2Freq()
#else
#define SERVO_TIMER_ENREG APB1LENR
#define SERVO_TIMER_RESETREG APB1LRSTR
#define SERVO_TIMER_APB __helper__(RCC_APB1LENR_TIM, SERVO_TIMER, EN)
#define SERVO_TIMER_CLOCK HAL_RCC_GetPCLK1Freq()
#endif

#ifdef ONESHOT_TIMER
#define MCU_HAS_ONESHOT_TIMER

#if (ONESHOT_TIMER == 6)
#define MCU_ONESHOT_ISR TIM6_DAC_IRQHandler
#define MCU_ONESHOT_IRQ TIM6_DAC_IRQn
#elif (ONESHOT_TIMER == 9)
#define MCU_ONESHOT_ISR TIM1_BRK_TIM9_IRQHandler
#define MCU_ONESHOT_IRQ TIM1_BRK_TIM9_IRQn
#elif (ONESHOT_TIMER == 10 || ONESHOT_TIMER == 1)
#define MCU_ONESHOT_ISR TIM1_UP_TIM10_IRQHandler
#define MCU_ONESHOT_IRQ TIM1_UP_TIM10_IRQn
#elif (ONESHOT_TIMER == 11)
#define MCU_ONESHOT_ISR TIM1_TRG_COM_TIM11_IRQHandler
#define MCU_ONESHOT_IRQ TIM1_TRG_COM_TIM11_IRQn
#elif (ONESHOT_TIMER == 12)
#define MCU_ONESHOT_ISR TIM8_BRK_TIM12_IRQHandler
#define MCU_ONESHOT_IRQ TIM8_BRK_TIM12_IRQn
#elif (ONESHOT_TIMER == 13 || ONESHOT_TIMER == 8)
#define MCU_ONESHOT_ISR TIM8_UP_TIM13_IRQHandler
#define MCU_ONESHOT_IRQ TIM8_UP_TIM13_IRQn
#elif (ONESHOT_TIMER == 14)
#define MCU_ONESHOT_ISR TIM8_TRG_COM_TIM14_IRQHandler
#define MCU_ONESHOT_IRQ TIM8_TRG_COM_TIM14_IRQn
#else
#define MCU_ONESHOT_ISR __helper__(TIM, ONESHOT_TIMER, _IRQHandler)
#define MCU_ONESHOT_IRQ __helper__(TIM, ONESHOT_TIMER, _IRQn)
#endif

#define ONESHOT_TIMER_REG __helper__(TIM, ONESHOT_TIMER, )

#if (ONESHOT_TIMER == 1 || (ONESHOT_TIMER >= 8 & ONESHOT_TIMER <= 11) ||       \
     (ONESHOT_TIMER >= 15 & ONESHOT_TIMER <= 17))
#define ONESHOT_TIMER_ENREG APB2ENR
#define ONESHOT_TIMER_RESETREG APB2RSTR
#define ONESHOT_TIMER_APB __helper__(RCC_APB2ENR_TIM, ONESHOT_TIMER, EN)
#define ONESHOT_TIMER_CLOCK HAL_RCC_GetPCLK2Freq()
#else
#define ONESHOT_TIMER_ENREG APB1LENR
#define ONESHOT_TIMER_RESETREG APB1LRSTR
#define ONESHOT_TIMER_APB __helper__(RCC_APB1LENR_TIM, ONESHOT_TIMER, EN)
#define ONESHOT_TIMER_CLOCK HAL_RCC_GetPCLK1Freq()
#endif
#endif

#ifndef __indirect__
#define __indirect__ex__(X, Y) DIO##X##_##Y
#define __indirect__(X, Y) __indirect__ex__(X, Y)
#endif

#ifndef BYTE_OPS
#define BYTE_OPS
// Set bit y in byte x
#define SETBIT(x, y) ((x) |= (1 << (y)))
// Clear bit y in byte x
#define CLEARBIT(x, y) ((x) &= ~(1 << (y)))
// Check bit y in byte x
#define CHECKBIT(x, y) ((x) & (1 << (y)))
// Toggle bit y in byte x
#define TOGGLEBIT(x, y) ((x) ^= (1 << (y)))
// Set byte y in byte x
#define SETFLAG(x, y) ((x) |= (y))
// Clear byte y in byte x
#define CLEARFLAG(x, y) ((x) &= ~(y))
// Check byte y in byte x
#define CHECKFLAG(x, y) ((x) & (y))
// Toggle byte y in byte x
#define TOGGLEFLAG(x, y) ((x) ^= (y))
#endif

#define mcu_config_input(diopin)                                               \
  {                                                                            \
    RCC->AHB4ENR |= __indirect__(diopin, RCCEN);                               \
    __indirect__(diopin, GPIO)->MODER &=                                       \
        ~(GPIO_RESET << ((__indirect__(diopin, BIT))                           \
                         << 1)); /*reset dir (defaults to input)*/             \
  }

#define mcu_config_output(diopin)                                              \
  {                                                                            \
    RCC->AHB4ENR |= __indirect__(diopin, RCCEN);                               \
    __indirect__(diopin, GPIO)->MODER &=                                       \
        ~(GPIO_RESET << ((__indirect__(diopin, BIT)) << 1)); /*reset dir*/     \
    __indirect__(diopin, GPIO)->MODER |=                                       \
        (GPIO_OUTPUT << ((__indirect__(diopin, BIT)) << 1)); /*output mode*/   \
    __indirect__(diopin, GPIO)->OSPEEDR |=                                     \
        (0x02 << ((__indirect__(diopin, BIT)) << 1)); /*output mode*/          \
  }

#define mcu_config_af(diopin, afrval)                                          \
  {                                                                            \
    RCC->AHB4ENR |= __indirect__(diopin, RCCEN);                               \
    __indirect__(diopin, GPIO)->MODER &=                                       \
        ~(GPIO_RESET << ((__indirect__(diopin, BIT)) << 1)); /*reset dir*/     \
    __indirect__(diopin, GPIO)->MODER |=                                       \
        (GPIO_AF << ((__indirect__(diopin, BIT)) << 1)); /*af mode*/           \
    __indirect__(diopin, GPIO)->AFR[(__indirect__(diopin, BIT) >> 3)] &=       \
        ~(0xf << ((__indirect__(diopin, BIT) & 0x07) << 2));                   \
    __indirect__(diopin, GPIO)->AFR[(__indirect__(diopin, BIT) >> 3)] |=       \
        (afrval << ((__indirect__(diopin, BIT) & 0x07) << 2)); /*af mode*/     \
    __indirect__(diopin, GPIO)->OSPEEDR |=                                     \
        (0x03 << ((__indirect__(diopin, BIT)) << 1)); /*output mode*/          \
  }

