Paciente8159/uCNC/uCNC/src/hal/mcus/stm32h7x/mcumap_stm32h7x.h
#define mcu_config_pullup(diopin)                                              \
  {                                                                            \
    __indirect__(diopin, GPIO)->PUPDR &=                                       \
        ~(GPIO_RESET << ((__indirect__(diopin, BIT)) << 1));                   \
    __indirect__(diopin, GPIO)->PUPDR |=                                       \
        (GPIO_IN_PULLUP << ((__indirect__(diopin, BIT)) << 1));                \
  }

#define mcu_config_opendrain(diopin)                                           \
  {                                                                            \
    __indirect__(diopin, GPIO)->OTYPER |=                                      \
        (1 << ((__indirect__(diopin, BIT))));                                  \
  }

#define mcu_config_pwm(diopin, freq)                                           \
  {                                                                            \
    RCC->AHB4ENR |= __indirect__(diopin, RCCEN);                               \
    __indirect__(diopin, ENREG) |= __indirect__(diopin, APBEN);                \
    __indirect__(diopin, GPIO)->MODER &=                                       \
        ~(GPIO_RESET << ((__indirect__(diopin, BIT)) << 1)); /*reset dir*/     \
    __indirect__(diopin, GPIO)->MODER |=                                       \
        (GPIO_AF << ((__indirect__(diopin, BIT)) << 1)); /*af mode*/           \
    __indirect__(diopin, GPIO)->AFR[(__indirect__(diopin, BIT) >> 3)] &=       \
        ~(0xf << ((__indirect__(diopin, BIT) & 0x07) << 2));                   \
    __indirect__(diopin, GPIO)->AFR[(__indirect__(diopin, BIT) >> 3)] |=       \
        ((__indirect__(diopin, AF)                                             \
          << ((__indirect__(diopin, BIT) & 0x07) << 2))); /*af mode*/          \
    __indirect__(diopin, TIMREG)->CR1 = 0;                                     \
    __indirect__(diopin, TIMREG)->PSC =                                        \
        (uint16_t)(__indirect__(diopin, CLOCK) / 500000UL) - 1;                \
    __indirect__(diopin, TIMREG)->ARR = (uint16_t)(1000000UL / freq);          \
    __indirect__(diopin, TIMREG)->__indirect__(diopin, CCR) = 0;               \
    __indirect__(diopin, TIMREG)->__indirect__(diopin, CCMREG) =               \
        __indirect__(diopin, MODE);                                            \
    __indirect__(diopin, TIMREG)->CCER |=                                      \
        (1U << ((__indirect__(diopin, CHANNEL) - 1) << 2));                    \
    __indirect__(diopin, TIMREG)->BDTR |= (1 << 15);                           \
    __indirect__(diopin, TIMREG)->CR1 |= 0x01U;                                \
    __indirect__(diopin, ENOUTPUT);                                            \
  }

#define mcu_config_input_isr(diopin)                                           \
  {                                                                            \
    RCC->APB2ENR |= RCC_APB2ENR_SYSCFGEN;                                      \
    SYSCFG->EXTICR[(__indirect__(diopin, EXTIREG))] &=                         \
        ~(0xF << (((__indirect__(diopin, BIT)) & 0x03) << 2));                 \
    SYSCFG->EXTICR[(__indirect__(diopin, EXTIREG))] |=                         \
        (__indirect__(diopin, EXTIVAL));                                       \
    SETBIT(EXTI->RTSR, __indirect__(diopin, BIT));                             \
    SETBIT(EXTI->FTSR, __indirect__(diopin, BIT));                             \
    SETBIT(EXTI->IMR, __indirect__(diopin, BIT));                              \
    NVIC_SetPriority(__indirect__(diopin, IRQ), NVIC_INPUT_IRQ_Pri);           \
    NVIC_ClearPendingIRQ(__indirect__(diopin, IRQ));                           \
    NVIC_EnableIRQ(__indirect__(diopin, IRQ));                                 \
  }

#ifndef ADC1_COMMON
#define ADC1_COMMON ADC12_COMMON
#endif
#ifndef ADC2_COMMON
#define ADC2_COMMON ADC12_COMMON
#endif
#ifndef ADC3_COMMON
#define ADC3_COMMON ADC123_COMMON
#endif

#define ADC_COMMON(X) __helper__(ADC, __indirect__(X, ADC), _COMMON)
#define ADC(X) __helper__(ADC, __indirect__(X, ADC), )

// configuration
// CR=268436224
// CFGR=2147487756
// CFG2=0;
// SMPR1=268435455
// SMPR2=1073741823
// CCR=196608
// PSEL=0
// channel select
// SMPR2=1072431103
// PSEL=65536
// SQR1=1024
// CALFACT=995
// start
// CR=268436225

#define mcu_config_analog(diopin)                                              \
  {                                                                            \
    RCC->AHB4ENR |= __indirect__(diopin, RCCEN);                               \
    __indirect__(diopin, GPIO)->MODER &=                                       \
        ~(GPIO_RESET << ((__indirect__(diopin, BIT)) << 1)); /*reset dir*/     \
    __indirect__(diopin, GPIO)->MODER |=                                       \
        (GPIO_ANALOG << ((__indirect__(diopin, BIT)) << 1)); /*analog mode*/   \
    if (__indirect__(diopin, ADC) != 3) {                                      \
      RCC->AHB1ENR |= (RCC_AHB1ENR_ADC12EN);                                   \
    } else {                                                                   \
      RCC->AHB4ENR |= RCC_AHB4ENR_ADC3EN;                                      \
    }                                                                          \
    ADC_COMMON(diopin)->CCR &= ~(ADC_CCR_PRESC | ADC_CCR_CKMODE);              \
    ADC_COMMON(diopin)->CCR |=                                                 \
        (/*ADC_CCR_PRESC_3 | */ ADC_CCR_CKMODE_1 | ADC_CCR_CKMODE_0);          \
    ADC(diopin)->SQR1 = 1; /*one conversion*/                                  \
    ADC(diopin)->SMPR1 = 0x4fffffff /*& 0x1B6DB6DB*/;                          \
    ADC(diopin)->SMPR2 = 0x4ffffffff /*& 0x1B6DB6DB*/;                         \
    ADC(diopin)->CFGR =                                                        \
        0x8000100C; /*10-bit resolution / Injected Queue disable /  ADC_DR     \
                       register is overwritten / external start trigger        \
                       software */                                             \
    ADC(diopin)->CFGR2 = 0;                                                    \
    ADC(diopin)->CR &= ~ADC_CR_DEEPPWD; /*disable power down*/                 \
    ADC(diopin)->CR |= ADC_CR_BOOST;    /*enable boost mode*/                  \
    ADC(diopin)->ISR |= ADC_ISR_LDORDY;                                        \
    ADC(diopin)->CR |= (ADC_CR_ADVREGEN); /*enable adc voltage reg*/           \
    while (!(ADC(diopin)->ISR & ADC_ISR_LDORDY))                               \
      ;                                                                        \
  }

#define mcu_get_input(diopin)                                                  \
  (CHECKBIT(__indirect__(diopin, GPIO)->IDR, __indirect__(diopin, BIT)))
#define mcu_get_output(diopin)                                                 \
  (CHECKBIT(__indirect__(diopin, GPIO)->ODR, __indirect__(diopin, BIT)))
#define mcu_set_output(diopin)                                                 \
  (__indirect__(diopin, GPIO)->BSRR = (1UL << __indirect__(diopin, BIT)))
#define mcu_clear_output(diopin)                                               \
  (__indirect__(diopin, GPIO)->BSRR =                                          \
       ((1UL << 16) << __indirect__(diopin, BIT)))
#define mcu_toggle_output(diopin)                                              \
  (TOGGLEBIT(__indirect__(diopin, GPIO)->ODR, __indirect__(diopin, BIT)))
#define mcu_set_pwm(diopin, pwmvalue)                                          \
  {                                                                            \
    __indirect__(diopin, TIMREG)->__indirect__(diopin, CCR) =                  \
        (uint16_t)((__indirect__(diopin, TIMREG)->ARR * pwmvalue) / 255);      \
  }

#define mcu_get_pwm(diopin)                                                    \
  ((uint8_t)((((uint32_t)__indirect__(diopin, TIMREG)                          \
                   ->__indirect__(diopin, CCR)) *                              \
              255) /                                                           \
             ((uint32_t)__indirect__(diopin, TIMREG)->ARR)))

