Paciente8159/uCNC/uCNC/src/hal/mcus/stm32h7x/mcumap_stm32h7x.h
#define mcu_get_analog(diopin)                                                 \
  ({                                                                           \
    ADC(diopin)->ISR |= ADC_ISR_ADRDY;                                         \
    ADC(diopin)->CR |= ADC_CR_ADEN; /*enable adc*/                             \
    while (!(ADC(diopin)->ISR & ADC_ISR_ADRDY))                                \
      ;                                                                        \
    ADC(diopin)->PCSEL = (1UL << __indirect__(diopin, CHANNEL));               \
    ADC(diopin)->SQR1 = (__indirect__(diopin, CHANNEL) << ADC_SQR1_SQ1_Pos);   \
    ADC(diopin)->CFGR &= ~ADC_CFGR_CONT; /*single conversion mode*/            \
    ADC(diopin)->CR |= ADC_CR_ADSTART;                                         \
    while (!(ADC(diopin)->ISR & ADC_ISR_EOC))                                  \
      ;                                                                        \
    int16_t read = (/*0x3FF &*/ (ADC(diopin)->DR));                            \
    ADC(diopin)->CR |= ADC_CR_ADDIS; /*disable adc*/                           \
    read;                                                                      \
  })

#if defined(PROBE) && defined(PROBE_ISR)
#define mcu_enable_probe_isr() SETBIT(EXTI->IMR, PROBE_BIT)
#define mcu_disable_probe_isr() CLEARBIT(EXTI->IMR, PROBE_BIT)
#else
#define mcu_enable_probe_isr()
#define mcu_disable_probe_isr()
#endif

#define mcu_enable_global_isr __enable_irq
#define mcu_disable_global_isr __disable_irq
#define mcu_get_global_isr() (__get_PRIMASK() == 0u)
#define mcu_in_isr_context() (__get_IPSR() != 0)
#define mcu_free_micros()                                                      \
  ((uint32_t)((((SysTick->LOAD + 1) - SysTick->VAL) * 1000UL) /                \
              (SysTick->LOAD + 1)))

#define GPIO_RESET 0x3U
#define GPIO_INPUT 0x0U
#define GPIO_OUTPUT 0x1U
#define GPIO_AF 0x2U
#define GPIO_ANALOG 0x3U

#define GPIO_IN_FLOAT 0x4U
#define GPIO_IN_PUP 0x8U
#define GPIO_IN_ANALOG 0 // not needed after reseting bits

#define GPIO_IN_PULLUP 0x1U

#ifdef MCU_HAS_ONESHOT_TIMER

/**
 * starts the timeout. Once hit the the respective callback is called
 * */
#define mcu_start_timeout()                                                    \
  ({                                                                           \
    ONESHOT_TIMER_REG->SR = 0;                                                 \
    ONESHOT_TIMER_REG->CNT = 0;                                                \
    ONESHOT_TIMER_REG->DIER |= 1;                                              \
    ONESHOT_TIMER_REG->CR1 |= 1;                                               \
  })
#endif

#ifdef __cplusplus
}
#endif

#endif
